src/InformationRegisters/РасписанияОтчетовПоставщикамVMI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РасписанияОтчетовПоставщикамVMI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачальнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Частота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧислоМесяца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разделять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецМесяцаОтдельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧетНечет</Name>
					<Comment>1 - каждый, 2 - четный, 3 - нечетный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД77</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияПериодаПоследнегоОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задержка</Name>
					<Comment>Задержка при отправке отчета на конец месяца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СкидкаПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрайсПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсыПоставщиковVMI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/РасписанияОтчетовПоставщикамVMI/Ext/ManagerModule.bsl
Функция ПолучитьТекущееРасписание(вхСтруктураОтбора) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика,
	|	РасписанияОтчетовПоставщикамVMI.Организация,
	|	РасписанияОтчетовПоставщикамVMI.Склад,
	|	РасписанияОтчетовПоставщикамVMI.Используется,
	|	РасписанияОтчетовПоставщикамVMI.НачальнаяДата,
	|	РасписанияОтчетовПоставщикамVMI.Периодичность,
	|	РасписанияОтчетовПоставщикамVMI.Частота,
	|	РасписанияОтчетовПоставщикамVMI.ЧислоМесяца,
	|	РасписанияОтчетовПоставщикамVMI.Разделять,
	|	РасписанияОтчетовПоставщикамVMI.КонецМесяцаОтдельно,
	|	РасписанияОтчетовПоставщикамVMI.ЧетНечет,
	|	РасписанияОтчетовПоставщикамVMI.ДеньНедели,
	|	РасписанияОтчетовПоставщикамVMI.Информация,
	|	РасписанияОтчетовПоставщикамVMI.УИД77,
	|	РасписанияОтчетовПоставщикамVMI.ДатаОкончанияПериодаПоследнегоОтчета,
	|	РасписанияОтчетовПоставщикамVMI.СкидкаПроцент,
	|	РасписанияОтчетовПоставщикамVMI.СкидкаСумма,
	|	РасписанияОтчетовПоставщикамVMI.ДелитьОтчетVMI,
	|	РасписанияОтчетовПоставщикамVMI.Задержка
	|ИЗ
	|	РегистрСведений.РасписанияОтчетовПоставщикамVMI КАК РасписанияОтчетовПоставщикамVMI
	|ГДЕ
	|	РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика = &ПрайсПоставщика"
	);
	
	тхтУсловие = "";
	
	Если ТипЗнч(вхСтруктураОтбора) = Тип("СправочникСсылка.ПрайсыПоставщиковVMI") тогда
		тхтУсловие = тхтУсловие + "
		|	РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика = &ПрайсПоставщика";
		Запрос.УстановитьПараметр("ПрайсПоставщика", вхСтруктураОтбора);
	ИначеЕсли ТипЗнч(вхСтруктураОтбора) = Тип("СправочникСсылка.Организации") тогда
		тхтУсловие = тхтУсловие + "
		|	РасписанияОтчетовПоставщикамVMI.Организация = &Организация";
		Запрос.УстановитьПараметр("Организация", вхСтруктураОтбора);
	ИначеЕсли ТипЗнч(вхСтруктураОтбора) = Тип("СправочникСсылка.Склады") тогда
		тхтУсловие = тхтУсловие + "
		|	РасписанияОтчетовПоставщикамVMI.Склад = &Склад";
		Запрос.УстановитьПараметр("Склад", вхСтруктураОтбора);
	ИначеЕсли ТипЗнч(вхСтруктураОтбора) = Тип("Структура") тогда
		Если вхСтруктураОтбора.Свойство("ПрайсПоставщика") Тогда
			тхтУсловие = тхтУсловие + ?(ПустаяСтрока(тхтУсловие), "", " И ") + "
			|	РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика = &ПрайсПоставщика";
			Запрос.УстановитьПараметр("ПрайсПоставщика", вхСтруктураОтбора.ПрайсПоставщика);
		КонецЕсли;
		Если вхСтруктураОтбора.Свойство("Организация") Тогда
			тхтУсловие = тхтУсловие + ?(ПустаяСтрока(тхтУсловие), "", " И ") + "
			|	РасписанияОтчетовПоставщикамVMI.Организация = &Организация";
			Запрос.УстановитьПараметр("Организация", вхСтруктураОтбора.Организация);
		КонецЕсли;
		Если вхСтруктураОтбора.Свойство("Склад") Тогда
			тхтУсловие = тхтУсловие + ?(ПустаяСтрока(тхтУсловие), "", " И ") + "
			|	РасписанияОтчетовПоставщикамVMI.Склад = &Склад";
			Запрос.УстановитьПараметр("Склад", вхСтруктураОтбора.Склад);
		КонецЕсли;
	Иначе
		Возврат Неопределено;
		
	КонецЕсли;

	Если НЕ тхтУсловие = ""   тогда
		Запрос.текст = Запрос.Текст + " И " + тхтУсловие;
	КонецЕсли;	
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
